# Напишите программу, которая получает целое число и возвращает его шестнадцатеричное строковое представление.
# Функцию hex используйте для проверки своего результата.

a = int(input("Введите целое число: "))
print("Число в шестандацатиричном представлении = " + str(hex(a)))
